jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_adc.h
/* Standard copyright does not go in this file because
* of the use of Microchip provided macros, see comments below.
*/
// Documentation for this file. If the \file tag isn't present,
// this file won't be documented.
/** \file
 *  To do.
 */

#ifndef  _PIC24_ADC_H_
#define _PIC24_ADC_H_


/**
 *  Prototype PIC24_ADC library functions here
 *      (functions live in the common/pic24_adc.c file)
 */
uint16 convertADC1(void);
void configADC1_ManualCH0(uint16 u16_Ch0PositiveMask,uint8 u8_autoSampleTime,uint8 u8_Use12bits);
void configADC1_AutoScanIrqCH0(uint16 u16_ch0ScanMask,uint8 u8_autoSampleTime,uint8 u8_12bit);
void configADC1_AutoHalfScanIrqCH0(uint16 u16_ch0ScanMask,uint8 u8_autoSampleTime,uint8 u8_12bit);
void configADC1_Simul4ChanIrq(uint8 u8_ch0Select, uint16 u16_ch123SelectMask, uint16 u16_numTcyMask);

/** Determines if the conversion on AD1 is done.
 *  Returns 1 if the conversion has completed, or 0 if the conversion
 *  has not started or is in progress.
 *  \return True (1) if the conversion has completed, 0 if not.
 */
#define IS_CONVERSION_COMPLETE_ADC1()    AD1CON1bits.DONE

/** Waits until the conversion is completed. */
inline static void WAIT_UNTIL_CONVERSION_COMPLETE_ADC1() {
  while (!IS_CONVERSION_COMPLETE_ADC1())
    doHeartbeat();
}

/** Determines if the AD1 sample-and-hold amplifier(s) are sampling.
 *  Returns 1 if the sample-and-hold amplifier(s) are sampling,
 *  or 0 if sample-and-hold amplifier(s) are holding.
 *  \return True (1) if the sample-and-hold amplifier(s) are sampling, 0 if not.
 */
#define IS_SAMPLING_ADC1()         AD1CON1bits.SAMP
#define SET_SAMP_BIT_ADC1()        AD1CON1bits.SAMP=1

/*
The following macros are a subset of the AND/OR macros found in the
the MPLAB C30/src/peripheral_24F/include/adc.h file and placed
in this header for use solely and exclusively on Microchip
PICmicro Microcontroller products as
specified in the MPLAB C30/src/peripheral_24F/include/adc.h header.

Edits have been made in the comments to correct some
minor typos.
*/
/* AD1CON1 Configuration Bit Definitions */

#define ADC_MODULE_ON               0x8000 /* A/D Converter on */
#define ADC_MODULE_OFF              0x0000 /* A/D Converter off */
#define ADC_MODULE_MASK             (~ADC_MODULE_ON)

#define ADC_IDLE_CONTINUE           0x2000 /* A/D Operate in Idle mode */
#define ADC_IDLE_STOP               0x0000 /* A/D Stop in Idle mode */
#define ADC_IDLE_MASK               (~ADC_IDLE_CONTINUE)

#define ADC_ADDMABM_SCATTER         0x0000 /* DMA buffers are written in Scatter/Gather mode */
#define ADC_ADDMABM_ORDER           0x1000 /* DMA buffers are written in the order of conversion */
#define ADC_ADDMABM_MASK            (~ADC_ADDMABM_ORDER)

#define ADC_12BIT                   0x0400 /* A/D conversion is 12bits instead of 10bits */
#define ADC_10BIT                   0x0000 /* A/D conversion is normal 10bits */

#define ADC_FORMAT_SIGN_FRACT       0x0300 /* A/D data format signed fractional */
#define ADC_FORMAT_FRACT            0x0200 /* A/D data format fractional */
#define ADC_FORMAT_SIGN_INT         0x0100 /* A/D data format signed integer */
#define ADC_FORMAT_INTG             0x0000 /* A/D data format integer */
#define ADC_FORMAT_MASK             (~ADC_FORMAT_SIGN_FRACT)

#define ADC_CLK_AUTO                0x00E0  /* Internal counter ends sampling and starts conversion (Auto convert) */
#define ADC_CLK_MPWM                0x0060  /* MPWM interval ends sampling and starts conversion */
#define ADC_CLK_TMR                 0x0040  /* GP Timer compare ends sampling and starts conversion */
#define ADC_CLK_INT0                0x0020  /* Active transition on INTx ends sampling and starts conversion */
#define ADC_CLK_MANUAL              0x0000  /* Clearing sample (SAMP) bit ends sampling and starts conversion */
#define ADC_CLK_MASK                (~ADC_CLK_AUTO)

#define ADC_SAMPLE_SIMULTANEOUS     0x0008  /* 10bit Only: samples CH0/1 or CH0/1/2/3 simultaneously depending on ADxCON2.CHPS bits */
#define ADC_SAMPLE_INDIVIDUAL       0x0000  /* Samples channels sequentially */

#define ADC_AUTO_SAMPLING_ON        0x0004  /* Sampling begins immediately after last conversion */
#define ADC_AUTO_SAMPLING_OFF       0x0000  /* Sampling begins when SAMP bit is set */
#define ADC_AUTO_SAMPLING_MASK      (~ADC_AUTO_SAMPLING_ON)

#define ADC_SAMP_ON                 0x0002  /* sample / hold amplifiers are sampling */
#define ADC_SAMP_OFF                0x0000 /* sample / hold amplifiers are holding */
#define ADC_SAMP_MASK               (~ADC_SAMP_ON)


/* defines for the ADCON2 register */
#define ADC_VREF_EXT_AVSS           0x2000  /* A/D Voltage reference configuration Vref+ external and Vref- is AVss */
#define ADC_VREF_AVDD_EXT           0x4000  /* A/D Voltage reference configuration Vref+ AVdd and Vref- external */
#define ADC_VREF_EXT_EXT            0x6000  /* A/D Voltage reference configuration both Vref+ and Vref- are external */
#define ADC_VREF_AVDD_AVSS          0x8000  /* A/D Voltage reference configuration Vref+ is AVdd and Vref- is AVss */
#define ADC_VREF_MASK               (~(ADC_VREF_AVDD_AVSS | ADC_VREF_EXT_EXT))/* A/D Voltage reference configuration Vref+ is AVdd and Vref- is AVss */

#define ADC_SCAN_ON                 0x0400  /* A/D Scan Input Selections for CH0 during SAMPLE A */
#define ADC_SCAN_OFF                0x0000  /* A/D Do notScan Input Selections for CH0+ during SAMPLE A */
#define ADC_SCAN_MASK               (~ADC_SCAN_ON)

#define ADC_CONVERT_CH0             0x0000  /* 10bit Only: A/D converts CH0 */
#define ADC_CONVERT_CH01            0x0100  /* 10bit Only: A/D converts CH0, CH1 */
#define ADC_CONVERT_CH0123          0x0300  /* 10bit Only: A/D converts CH0, CH1, CH2, CH3 */

#define ADC_INTR_EACH_CONV          0x0000  /* Interrupts at the completion of conversion of each sample */
#define ADC_INTR_2_CONV             0x0004  /* Interrupts at the completion of conversion of 2 samples */
#define ADC_INTR_3_CONV             0x0008  /* Interrupts at the completion of conversion of 3 samples */
#define ADC_INTR_4_CONV             0x000C  /* Interrupts at the completion of conversion of 4 samples */
#define ADC_INTR_5_CONV             0x0010  /* Interrupts at the completion of conversion of 5 samples */
#define ADC_INTR_6_CONV             0x0014  /* Interrupts at the completion of conversion of 6 samples */
#define ADC_INTR_7_CONV             0x0018  /* Interrupts at the completion of conversion of 7 samples */
#define ADC_INTR_8_CONV             0x001C  /* Interrupts at the completion of conversion of 8 samples */
#define ADC_INTR_9_CONV             0x0020  /* Interrupts at the completion of conversion of 9 samples */
#define ADC_INTR_10_CONV            0x0024  /* Interrupts at the completion of conversion of 10 samples */
#define ADC_INTR_11_CONV            0x0028  /* Interrupts at the completion of conversion of 11 samples */
#define ADC_INTR_12_CONV            0x002C  /* Interrupts at the completion of conversion of 12 samples */
#define ADC_INTR_13_CONV            0x0030  /* Interrupts at the completion of conversion of 13 samples */
#define ADC_INTR_14_CONV            0x0034  /* Interrupts at the completion of conversion of 14 samples */
#define ADC_INTR_15_CONV            0x0038  /* Interrupts at the completion of conversion of 15 samples */
#define ADC_INTR_16_CONV            0x003C  /* Interrupts at the completion of conversion of 16 samples */
#define ADC_INTR_MASK               (~ADC_INTR_16_CONV)

/* BUFM bit defines */
#define ADC_ALT_BUF_ON              0x0002 /* Buffer configured as 2 8-word buffers */
#define ADC_ALT_BUF_OFF             0x0000 /* Buffer configured as 1 16-word buffer */
#define ADC_ALT_BUF_MASK            (~ADC_ALT_BUF_ON)
/* BUFS bit define */
#define ADC_ALT_BUF_STATUS_2        0x0080    /* ADC is 2nd half of buffer, read from 1st half */
#define ADC_ALT_BUF_STATUS_MASK     (~ADC_ALT_BUF_STATUS_MASK)

/* A/D Uses channel input selects for SAMPLE A on first sample and SAMPLE B on next sample */
#define ADC_ALT_INPUT_ON            0x0001 /* alternate between MUXA and MUXB */
/* A/D Always uses channel input selects for SAMPLE A */
#define ADC_ALT_INPUT_OFF           0x0000 /* use MUXA only */
#define ADC_ALT_MASK                (~ADC_ALT_INPUT_ON)

/* defines for ADCON3 register */
#define ADC_CONV_CLK_INTERNAL_RC    0x8000 /* A/D internal RC clock */
#define ADC_CONV_CLK_SYSTEM         0x0000 /* Clock derived from system clock */
#define ADC_CONV_CLK_SOURCE_MASK    (~ADC_CONV_CLK_INTERNAL_RC)

