jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_adc.h
#define ADC_CH0_NEG_SAMPLEA_AN1     0x0080  /*A/D CH0 neg I/P sel for SAMPLE A is AN1 */
#define ADC_CH0_NEG_SAMPLEA_VREFN   0x0000  /*A/D CH0 neg I/P sel for SAMPLE A is Vrefn */
#define ADC_CH0_NEG_SAMPLEA_MASK    (~ADC_CH0_NEG_SAMPLEA_AN1)

#define ADC_CH0_POS_SAMPLEA_AN15    0x000F  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN15 */
#define ADC_CH0_POS_SAMPLEA_AN14    0x000E  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN14 */
#define ADC_CH0_POS_SAMPLEA_AN13    0x000D  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN13 */
#define ADC_CH0_POS_SAMPLEA_AN12    0x000C  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN12 */
#define ADC_CH0_POS_SAMPLEA_AN11    0x000B  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN11 */
#define ADC_CH0_POS_SAMPLEA_AN10    0x000A  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN10 */
#define ADC_CH0_POS_SAMPLEA_AN9     0x0009  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN9 */
#define ADC_CH0_POS_SAMPLEA_AN8     0x0008  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN8 */
#define ADC_CH0_POS_SAMPLEA_AN7     0x0007  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN7 */
#define ADC_CH0_POS_SAMPLEA_AN6     0x0006  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN6 */
#define ADC_CH0_POS_SAMPLEA_AN5     0x0005  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN5 */
#define ADC_CH0_POS_SAMPLEA_AN4     0x0004  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN4 */
#define ADC_CH0_POS_SAMPLEA_AN3     0x0003  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN3 */
#define ADC_CH0_POS_SAMPLEA_AN2     0x0002  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN2 */
#define ADC_CH0_POS_SAMPLEA_AN1     0x0001  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN1 */
#define ADC_CH0_POS_SAMPLEA_AN0     0x0000  /* A/D Chan 0 pos i/p sel for SAMPLE A is AN0 */
#define ADC_CH0_POS_SAMPLEA_MASK    (~ADC_CH0_POS_SAMPLEA_AN15)

/* ADC1 Input channel 1,2,3 select register (AD1CHS123 register) */
#define ADC_CH123_NEG_SAMPLEB_AN9AN10AN11   0x0600  /* SAMPLE B neg.input for CHs 1,2,3 is AN9,AN10,AN11 */
#define ADC_CH123_NEG_SAMPLEB_AN6AN7AN8     0x0400  /* SAMPLE B neg.input for CHs 1,2,3 is AN6,AN7,AN8 */
#define ADC_CH123_NEG_SAMPLEB_VREFN         0x0000  /* SAMPLE B neg.input for CHs 1,2,3 is VREF- */
#define ADC_CH123_NEG_SAMPLEB_MASK          (~ADC_CH123_NEG_SAMPLEB_AN9_AN10_AN11)

#define ADC_CH123_POS_SAMPLEB_AN3AN4AN5     0x0100  /* SAMPLE B pos.input for CHs 1,2,3 is AN3,AN4,AN5 */
#define ADC_CH123_POS_SAMPLEB_AN0AN1AN2     0x0000  /* SAMPLE B pos.input for CHs 1,2,3 is AN3,AN4,AN5 */
#define ADC_CH123_POS_SAMPLEB_MASK          (~ADC_CH123_POS_SAMPLEB_AN3_AN4_AN5)

#define ADC_CH123_NEG_SAMPLEA_AN9AN10AN11   0x0006  /* SAMPLE A neg.input for CHs 1,2,3 is AN9,AN10,AN11 */
#define ADC_CH123_NEG_SAMPLEA_AN6AN7AN8     0x0004  /* SAMPLE A neg.input for CHs 1,2,3 is AN6,AN7,AN8 */
#define ADC_CH123_NEG_SAMPLEA_VREFN         0x0000  /* SAMPLE A neg.input for CHs 1,2,3 is VREF- */
#define ADC_CH123_NEG_SAMPLEA_MASK          (~ADC_CH123_NEG_SAMPLEA_AN9_AN10_AN11)

#define ADC_CH123_POS_SAMPLEA_AN3AN4AN5     0x0001  /* SAMPLE A pos.input for CHs 1,2,3 is AN3,AN4,AN5 */
#define ADC_CH123_POS_SAMPLEA_AN0AN1AN2     0x0000  /* SAMPLE A pos.input for CHs 1,2,3 is AN3,AN4,AN5 */
#define ADC_CH123_POS_SAMPLEA_MASK          (~ADC_CH123_POS_SAMPLEA_AN3_AN4_AN5)


/*defines for ADxPCFGL register */
#define ENABLE_AN0_ANA              0x0001 /*Enable AN0 in analog mode */
#define ENABLE_AN1_ANA              0x0002 /*Enable AN1 in analog mode */
#define ENABLE_AN2_ANA              0x0004 /*Enable AN2 in analog mode */
#define ENABLE_AN3_ANA              0x0008 /*Enable AN3 in analog mode */
#define ENABLE_AN4_ANA              0x0010 /*Enable AN4 in analog mode */
#define ENABLE_AN5_ANA              0x0020 /*Enable AN5 in analog mode */
#define ENABLE_AN6_ANA              0x0040 /*Enable AN6 in analog mode */
#define ENABLE_AN7_ANA              0x0080 /*Enable AN7 in analog mode */
#define ENABLE_AN8_ANA              0x0100 /*Enable AN8 in analog mode */
#define ENABLE_AN9_ANA              0x0200 /*Enable AN9 in analog mode */
#define ENABLE_AN10_ANA             0x0400 /*Enable AN10 in analog mode */
#define ENABLE_AN11_ANA             0x0800 /*Enable AN11 in analog mode */
#define ENABLE_AN12_ANA             0x1000 /*Enable AN12 in analog mode */
#define ENABLE_AN13_ANA             0x2000 /*Enable AN13 in analog mode */
#define ENABLE_AN14_ANA             0x4000 /*Enable AN14 in analog mode */
#define ENABLE_AN15_ANA             0x8000 /*Enable AN15 in analog mode */

#define ENABLE_ALL_ANA_0_15         0xFFFF /*Enable AN0-AN15 in analog mode */
#define ENABLE_ALL_DIG_0_15         0x0000 /*Enable AN0-AN15 in Digital mode */

/*defines for ADxCSSL register */
#define ADC_SCAN_AN0      0x0001 /*Enable Input Scan AN0 */
#define ADC_SCAN_AN1      0x0002 /*Enable Input Scan AN1 */
#define ADC_SCAN_AN2      0x0004 /*Enable Input Scan AN2 */
#define ADC_SCAN_AN3      0x0008 /*Enable Input Scan AN3 */
#define ADC_SCAN_AN4      0x0010 /*Enable Input Scan AN4 */
#define ADC_SCAN_AN5      0x0020 /*Enable Input Scan AN5 */
#define ADC_SCAN_AN6      0x0040 /*Enable Input Scan AN6 */
#define ADC_SCAN_AN7      0x0080 /*Enable Input Scan AN7 */
#define ADC_SCAN_AN8      0x0100 /*Enable Input Scan AN8 */
#define ADC_SCAN_AN9      0x0200 /*Enable Input Scan AN9 */
#define ADC_SCAN_AN10     0x0400 /*Enable Input Scan AN10 */
#define ADC_SCAN_AN11     0x0800 /*Enable Input Scan AN11 */
#define ADC_SCAN_AN12     0x1000 /*Enable Input Scan AN12 */
#define ADC_SCAN_AN13     0x2000 /*Enable Input Scan AN13 */
#define ADC_SCAN_AN14     0x4000 /*Enable Input Scan AN14 */
#define ADC_SCAN_AN15     0x8000 /*Enable Input Scan AN15 */

#define ENABLE_ALL_INPUT_SCAN       0xFFFF /*Enable Input Scan AN0-AN15 */
#define DISABLE_ALL_INPU_SCAN       0x0000 /*Disable Input Scan AN0-AN15 */

/*defines for ADxCSSH register */
#define ADC_SCAN_AN16     0x0001 /*Enable Input Scan AN16 */
#define ADC_SCAN_AN17     0x0002 /*Enable Input Scan AN17 */
#define ADC_SCAN_AN18     0x0004 /*Enable Input Scan AN18 */
#define ADC_SCAN_AN19     0x0008 /*Enable Input Scan AN19 */
#define ADC_SCAN_AN20     0x0010 /*Enable Input Scan AN20 */
#define ADC_SCAN_AN21     0x0020 /*Enable Input Scan AN21 */
#define ADC_SCAN_AN22     0x0040 /*Enable Input Scan AN22 */
#define ADC_SCAN_AN23     0x0080 /*Enable Input Scan AN23 */
#define ADC_SCAN_AN24     0x0100 /*Enable Input Scan AN24 */
#define ADC_SCAN_AN25     0x0200 /*Enable Input Scan AN25 */
#define ADC_SCAN_AN26     0x0400 /*Enable Input Scan AN26 */
#define ADC_SCAN_AN27     0x0800 /*Enable Input Scan AN27 */
#define ADC_SCAN_AN28     0x1000 /*Enable Input Scan AN28 */
#define ADC_SCAN_AN29     0x2000 /*Enable Input Scan AN29 */
#define ADC_SCAN_AN30     0x4000 /*Enable Input Scan AN30 */
#define ADC_SCAN_AN31     0x8000 /*Enable Input Scan AN31 */

/* Setting the priority of adc interrupt */
#define ADC_INT_PRI_0               0x0000
#define ADC_INT_PRI_1               0x0001
#define ADC_INT_PRI_2               0x0002
#define ADC_INT_PRI_3               0x0003
#define ADC_INT_PRI_4               0x0004
#define ADC_INT_PRI_5               0x0005
#define ADC_INT_PRI_6               0x0006
#define ADC_INT_PRI_7               0x0007

/* enable / disable interrupts */

#define ADC_INT_ENABLE              0x0008
#define ADC_INT_DISABLE             ~ADC_INT_ENABLE

/* ADxCON4  */
#define ADC_1_WORD_PER_INPUT        0
#define ADC_2_WORD_PER_INPUT        1
#define ADC_4_WORD_PER_INPUT        2
#define ADC_8_WORD_PER_INPUT        3
#define ADC_16_WORD_PER_INPUT       4
#define ADC_32_WORD_PER_INPUT       5
#define ADC_64_WORD_PER_INPUT       6
#define ADC_128_WORD_PER_INPUT      7




#endif          // _PIC24_ADC_H_
